; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	spectrograph1 - mode
	thermograph0 - mode
	Star1 - direction
	GroundStation12 - direction
	GroundStation11 - direction
	GroundStation9 - direction
	Star0 - direction
	GroundStation14 - direction
	Star4 - direction
	GroundStation13 - direction
	GroundStation3 - direction
	GroundStation6 - direction
	GroundStation2 - direction
	GroundStation5 - direction
	GroundStation8 - direction
	GroundStation10 - direction
	Star7 - direction
	Phenomenon15 - direction
	Planet16 - direction
	Star17 - direction
	Planet18 - direction
	Planet19 - direction
)
(:init
	(supports instrument0 spectrograph1)
	(supports instrument0 thermograph0)
	(calibration_target instrument0 Star4)
	(calibration_target instrument0 GroundStation9)
	(calibration_target instrument0 GroundStation10)
	(calibration_target instrument0 GroundStation11)
	(calibration_target instrument0 GroundStation14)
	(supports instrument1 thermograph0)
	(supports instrument1 spectrograph1)
	(calibration_target instrument1 GroundStation8)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation2)
	(supports instrument2 thermograph0)
	(supports instrument2 spectrograph1)
	(calibration_target instrument2 GroundStation2)
	(calibration_target instrument2 GroundStation6)
	(calibration_target instrument2 GroundStation14)
	(calibration_target instrument2 Star0)
	(supports instrument3 thermograph0)
	(calibration_target instrument3 Star4)
	(calibration_target instrument3 GroundStation2)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation10)
	(supports instrument4 spectrograph1)
	(supports instrument4 thermograph0)
	(calibration_target instrument4 GroundStation6)
	(calibration_target instrument4 GroundStation3)
	(calibration_target instrument4 GroundStation10)
	(calibration_target instrument4 GroundStation13)
	(calibration_target instrument4 GroundStation2)
	(supports instrument5 thermograph0)
	(supports instrument5 spectrograph1)
	(calibration_target instrument5 Star7)
	(calibration_target instrument5 GroundStation10)
	(calibration_target instrument5 GroundStation8)
	(calibration_target instrument5 GroundStation5)
	(calibration_target instrument5 GroundStation2)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation14)
)
(:goal (and
	(pointing satellite1 GroundStation2)
	(pointing satellite2 GroundStation14)
	(have_image Phenomenon15 spectrograph1)
	(have_image Planet16 thermograph0)
	(have_image Star17 thermograph0)
	(have_image Planet18 thermograph0)
	(have_image Planet19 spectrograph1)
))

)

; plan
1. (turn_to satellite1 groundstation2 groundstation10)
   deleted: (pointing satellite1 groundstation10)
   added: (pointing satellite1 groundstation2)
   goals met: 2 of 7
2. (turn_to satellite0 groundstation10 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 groundstation10)
   goals met: 2 of 7
3. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 2 of 7
4. (calibrate satellite0 instrument0 groundstation10)
   added: (calibrated instrument0)
   goals met: 2 of 7
5. (turn_to satellite0 planet16 groundstation10)
   deleted: (pointing satellite0 groundstation10)
   added: (pointing satellite0 planet16)
   goals met: 2 of 7
6. (take_image satellite0 planet16 instrument0 thermograph0)
   added: (have_image planet16 thermograph0)
   goals met: 3 of 7
7. (turn_to satellite0 phenomenon15 planet16)
   deleted: (pointing satellite0 planet16)
   added: (pointing satellite0 phenomenon15)
   goals met: 3 of 7
8. (take_image satellite0 phenomenon15 instrument0 spectrograph1)
   added: (have_image phenomenon15 spectrograph1)
   goals met: 4 of 7
9. (turn_to satellite0 planet18 phenomenon15)
   deleted: (pointing satellite0 phenomenon15)
   added: (pointing satellite0 planet18)
   goals met: 4 of 7
10. (take_image satellite0 planet18 instrument0 thermograph0)
   added: (have_image planet18 thermograph0)
   goals met: 5 of 7
11. (turn_to satellite0 planet19 planet18)
   deleted: (pointing satellite0 planet18)
   added: (pointing satellite0 planet19)
   goals met: 5 of 7
12. (take_image satellite0 planet19 instrument0 spectrograph1)
   added: (have_image planet19 spectrograph1)
   goals met: 6 of 7
13. (turn_to satellite0 star17 planet19)
   deleted: (pointing satellite0 planet19)
   added: (pointing satellite0 star17)
   goals met: 6 of 7
14. (take_image satellite0 star17 instrument0 thermograph0)
   added: (have_image star17 thermograph0)
   goals met: 7 of 7
